In [1]:
#import dependencies

import pandas as pd

In [2]:
#set path and read csv into a DataFrame

path = "Resources/air_emissons_by_source.csv"
df=pd.read_csv(path)
df.head()

,COU,Country,POL,Pollutant,VAR,Variable,YEA,Year,Unit Code,Unit,PowerCode Code,PowerCode,Reference Period Code,Reference Period,Value,Flag Codes,Flags
0,USA,United States,SOX,Sulphur Oxides,TOT,Total man-made emissions,2000,2000,TONNE,Tonnes,3,Thousands,NaN,NaN,14767.108,NaN,NaN
1,USA,United States,SOX,Sulphur Oxides,TOT,Total man-made emissions,2001,2001,TONNE,Tonnes,3,Thousands,NaN,NaN,14413.253,NaN,NaN
2,USA,United States,SOX,Sulphur Oxides,TOT,Total man-made emissions,2002,2002,TONNE,Tonnes,3,Thousands,NaN,NaN,13564.209,B,Break
3,USA,United States,SOX,Sulphur Oxides,TOT,Total man-made emissions,2003,2003,TONNE,Tonnes,3,Thousands,NaN,NaN,13360.887,NaN,NaN
4,USA,United States,SOX,Sulphur Oxides,TOT,Total man-made emissions,2004,2004,TONNE,Tonnes,3,Thousands,NaN,NaN,13146.333,NaN,NaN

In [3]:
#print column names

for col in df.columns:
    print(col)

COU
Country
POL
Pollutant
VAR
Variable
YEA
Year
Unit Code
Unit
PowerCode Code
PowerCode
Reference Period Code
Reference Period
Value
Flag Codes
Flags

In [4]:
#parse down df to only keep the columns we need 
df=df[["COU", "POL", "YEA", "Unit", "Value", "VAR"]]
df.head()

   COU  POL   YEA    Unit      Value  VAR
0  USA  SOX  2000  Tonnes  14767.108  TOT
1  USA  SOX  2001  Tonnes  14413.253  TOT
2  USA  SOX  2002  Tonnes  13564.209  TOT
3  USA  SOX  2003  Tonnes  13360.887  TOT
4  USA  SOX  2004  Tonnes  13146.333  TOT

In [5]:
#remove rows with unnecessary data
pollutants_extra=df[(df['POL']=="NMVOC") | (df['POL']=="PM10") | (df['POL']=="PM2-5")].index
df=df.drop(pollutants_extra)
df.head()

   COU  POL   YEA    Unit      Value  VAR
0  USA  SOX  2000  Tonnes  14767.108  TOT
1  USA  SOX  2001  Tonnes  14413.253  TOT
2  USA  SOX  2002  Tonnes  13564.209  TOT
3  USA  SOX  2003  Tonnes  13360.887  TOT
4  USA  SOX  2004  Tonnes  13146.333  TOT

In [6]:
#only keep data with TOT Varaiable 

df=df.loc[df["VAR"]=="TOT"]
df.head(25)

     COU  POL   YEA    Unit      Value  VAR
0    USA  SOX  2000  Tonnes  14767.108  TOT
1    USA  SOX  2001  Tonnes  14413.253  TOT
2    USA  SOX  2002  Tonnes  13564.209  TOT
3    USA  SOX  2003  Tonnes  13360.887  TOT
4    USA  SOX  2004  Tonnes  13146.333  TOT
5    USA  SOX  2005  Tonnes  13145.176  TOT
6    USA  SOX  2006  Tonnes  11854.056  TOT
7    USA  SOX  2007  Tonnes  10562.935  TOT
8    USA  SOX  2008  Tonnes   9302.125  TOT
9    USA  SOX  2009  Tonnes   8182.259  TOT
10   USA  SOX  2010  Tonnes   6951.162  TOT
11   USA  SOX  2011  Tonnes   5790.660  TOT
12   USA  SOX  2012  Tonnes   4521.158  TOT
13   USA  SOX  2013  Tonnes   4334.555  TOT
14   USA  SOX  2014  Tonnes   4176.349  TOT
15   USA  SOX  2015  Tonnes   3278.533  TOT
16   USA  SOX  2016  Tonnes   2621.311  TOT
238  USA  NOX  2000  Tonnes  20262.523  TOT
239  USA  NOX  2001  Tonnes  19393.710  TOT
240  USA  NOX  2002  Tonnes  21632.312  TOT
241  USA  NOX  2003  Tonnes  20445.527  TOT
242  USA  NOX  2004  Tonnes  19248.535  TOT
243  USA  NOX  2005  Tonnes  18380.739  TOT
244  USA  NOX  2006  Tonnes  17357.631  TOT
245  USA  NOX  2007  Tonnes  16334.523  TOT

In [7]:
#rename values so they will match the other df 
# df['POL'].replace({'SOX': 'SO2', 'NOX': 'NO2'})
df['POL']= df['POL'].replace({'SOX': 'SO2', 'NOX': 'NO2'})
df.head()

   COU  POL   YEA    Unit      Value  VAR
0  USA  SO2  2000  Tonnes  14767.108  TOT
1  USA  SO2  2001  Tonnes  14413.253  TOT
2  USA  SO2  2002  Tonnes  13564.209  TOT
3  USA  SO2  2003  Tonnes  13360.887  TOT
4  USA  SO2  2004  Tonnes  13146.333  TOT

In [8]:
#set index to year
df=df.set_index(["YEA"])
df.head()

      COU  POL    Unit      Value  VAR
YEA
2000  USA  SO2  Tonnes  14767.108  TOT
2001  USA  SO2  Tonnes  14413.253  TOT
2002  USA  SO2  Tonnes  13564.209  TOT
2003  USA  SO2  Tonnes  13360.887  TOT
2004  USA  SO2  Tonnes  13146.333  TOT

In [9]:
clean_df = df.dropna(axis = 0, how ='any')
clean_df.head(25)

      COU  POL    Unit      Value  VAR
YEA
2000  USA  SO2  Tonnes  14767.108  TOT
2001  USA  SO2  Tonnes  14413.253  TOT
2002  USA  SO2  Tonnes  13564.209  TOT
2003  USA  SO2  Tonnes  13360.887  TOT
2004  USA  SO2  Tonnes  13146.333  TOT
2005  USA  SO2  Tonnes  13145.176  TOT
2006  USA  SO2  Tonnes  11854.056  TOT
2007  USA  SO2  Tonnes  10562.935  TOT
2008  USA  SO2  Tonnes   9302.125  TOT
2009  USA  SO2  Tonnes   8182.259  TOT
2010  USA  SO2  Tonnes   6951.162  TOT
2011  USA  SO2  Tonnes   5790.660  TOT
2012  USA  SO2  Tonnes   4521.158  TOT
2013  USA  SO2  Tonnes   4334.555  TOT
2014  USA  SO2  Tonnes   4176.349  TOT
2015  USA  SO2  Tonnes   3278.533  TOT
2016  USA  SO2  Tonnes   2621.311  TOT
2000  USA  NO2  Tonnes  20262.523  TOT
2001  USA  NO2  Tonnes  19393.710  TOT
2002  USA  NO2  Tonnes  21632.312  TOT
2003  USA  NO2  Tonnes  20445.527  TOT
2004  USA  NO2  Tonnes  19248.535  TOT
2005  USA  NO2  Tonnes  18380.739  TOT
2006  USA  NO2  Tonnes  17357.631  TOT
2007  USA  NO2  Tonnes  16334.523  TOT

In [12]:
clean_df=clean_df[["POL", "Value"]]
clean_df=clean_df.reset_index()
clean_df.head()

    YEA  POL      Value
0  2000  SO2  14767.108
1  2001  SO2  14413.253
2  2002  SO2  13564.209
3  2003  SO2  13360.887
4  2004  SO2  13146.333

In [14]:
clean_df=clean_df.rename(columns={"YEA": "Year"})
clean_df.head()

   Year  POL      Value
0  2000  SO2  14767.108
1  2001  SO2  14413.253
2  2002  SO2  13564.209
3  2003  SO2  13360.887
4  2004  SO2  13146.333

In [15]:
so2_df=clean_df[(clean_df["POL"]=="SO2")]
so2_df.head(17)

    Year  POL      Value
0   2000  SO2  14767.108
1   2001  SO2  14413.253
2   2002  SO2  13564.209
3   2003  SO2  13360.887
4   2004  SO2  13146.333
5   2005  SO2  13145.176
6   2006  SO2  11854.056
7   2007  SO2  10562.935
8   2008  SO2   9302.125
9   2009  SO2   8182.259
10  2010  SO2   6951.162
11  2011  SO2   5790.660
12  2012  SO2   4521.158
13  2013  SO2   4334.555
14  2014  SO2   4176.349
15  2015  SO2   3278.533
16  2016  SO2   2621.311

In [16]:
co_df=clean_df[(clean_df["POL"]=="CO")]
co_df.head(17)

    Year POL      Value
34  2000  CO  92913.610
35  2001  CO  89375.868
36  2002  CO  79816.663
37  2003  CO  77602.959
38  2004  CO  75384.361
39  2005  CO  73161.908
40  2006  CO  70704.493
41  2007  CO  68247.078
42  2008  CO  61195.150
43  2009  CO  54933.143
44  2010  CO  55857.149
45  2011  CO  55393.766
46  2012  CO  53609.261
47  2013  CO  51824.755
48  2014  CO  50040.250
49  2015  CO  49064.690
50  2016  CO  46691.743

In [17]:
no2_df=clean_df[(clean_df["POL"]=="NO2")]
no2_df.head(17)

    Year  POL      Value
17  2000  NO2  20262.523
18  2001  NO2  19393.710
19  2002  NO2  21632.312
20  2003  NO2  20445.527
21  2004  NO2  19248.535
22  2005  NO2  18380.739
23  2006  NO2  17357.631
24  2007  NO2  16334.523
25  2008  NO2  15252.744
26  2009  NO2  14220.664
27  2010  NO2  13381.276
28  2011  NO2  13003.906
29  2012  NO2  12425.051
30  2013  NO2  11846.196
31  2014  NO2  11318.570
32  2015  NO2  10641.422
33  2016  NO2  10152.714

In [18]:
so2_df.to_csv("Resources/cleaned_air_emission_by_source_so2.csv")
co_df.to_csv("Resources/cleaned_air_emission_by_source_co.csv")
no2_df.to_csv("Resources/cleaned_air_emission_by_source_no2.csv")